// 1)-ПЕРЕМЕННЫЕ И БАЗОВЫЕ ВЫРАЖЕНИЯ---------ПРОЙДЕНО
// ------------------------------------------
// 2)-НАИМИНОВАНИЕ ПЕРЕМЕННХ
// -----------------------------------------
// 3)-МАТЕМАТИЧЕСКИЕ ОПЕРАЦЫИИ
// -----------------------------------------
// 4)-ТИПЫ ДАННЫХ
// -----------------------------------------
// 5)-ПРИВЕДЕНИЕ ТИПОВ
// -----------------------------------------
// 6)-ОПЕРАТОРЫ СРАВНЕНИЯ
// -----------------------------------------
// 7)-УСЛОВИЯ
// -----------------------------------------
// 8)-ТЕРНАРНЫЙ ОПЕРАТОР
for (let i = 0; i < 99999999999999999999999999999999999999999999999999; i++) {
    console.log(`пройдет ${i} круг`)
}
const numbers = [1, 2, 3, 4, 5]
for (let i = 0; i < numbers.length; i++) {
    console.log(numbers[i] + 1)
}